spec/fixtures/vcr_cassettes/tranfer_payouts_due.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/transfers
    body:
      encoding: US-ASCII
      string: amount=80&currency=usd&recipient=rp_14xutD2L7z1ZOsnrYyxhhFRL
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.16.0
      Authorization:
      - Bearer sk_test_UU7bBFT4BMFznL5a35ZE0CIx
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.16.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        pluto.local 14.0.0 Darwin Kernel Version 14.0.0: Fri Sep 19 00:26:44 PDT 2014;
        root:xnu-2782.1.97~2/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '60'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 12 Nov 2014 06:47:20 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '740'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - 76faf6e1-250e-44c8-bd3c-ff1ccb2f0181
      Stripe-Version:
      - '2014-09-08'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tr_14xuuS2L7z1ZOsnrtlLICizh",
          "object": "transfer",
          "created": 1415774840,
          "date": 1415774840,
          "livemode": false,
          "amount": 80,
          "currency": "usd",
          "status": "pending",
          "type": "bank_account",
          "balance_transaction": "txn_14xuuS2L7z1ZOsnrn8l9gWbE",
          "bank_account": {
            "object": "bank_account",
            "id": "ba_14xutD2L7z1ZOsnrsdMfpDwy",
            "last4": "6789",
            "country": "US",
            "currency": "usd",
            "status": "new",
            "fingerprint": "XJGQs2pPWYzzow5E",
            "bank_name": "STRIPE TEST BANK",
            "default_for_currency": false
          },
          "description": null,
          "failure_message": null,
          "failure_code": null,
          "metadata": {},
          "statement_description": null,
          "recipient": "rp_14xutD2L7z1ZOsnrYyxhhFRL"
        }
    http_version: 
  recorded_at: Wed, 12 Nov 2014 06:47:20 GMT
recorded_with: VCR 2.9.3
